microbit-foundation/cpp-editor-experiment/public/codal-wasm/pack/libraries/codal-microbit-nrf5sdk/nRF5SDK/components/softdevice/s140/headers/nrf_soc.h
/**@brief Closes a session for radio timeslot requests.
 *
 * @note Any current radio timeslot will be finished before the session is closed.
 * @note If a radio timeslot is scheduled when the session is closed, it will be canceled.
 * @note The application cannot consider the session closed until the @ref NRF_EVT_RADIO_SESSION_CLOSED
 *       event is received.
 *
 * @retval ::NRF_ERROR_FORBIDDEN If session not opened.
 * @retval ::NRF_ERROR_BUSY If session is currently being closed.
 * @retval ::NRF_SUCCESS Otherwise.
 */
 SVCALL(SD_RADIO_SESSION_CLOSE, uint32_t, sd_radio_session_close(void));

/**@brief Requests a radio timeslot.
 *
 * @note The request type is determined by p_request->request_type, and can be one of @ref NRF_RADIO_REQ_TYPE_EARLIEST
 *       and @ref NRF_RADIO_REQ_TYPE_NORMAL. The first request in a session must always be of type @ref NRF_RADIO_REQ_TYPE_EARLIEST.
 * @note For a normal request (@ref NRF_RADIO_REQ_TYPE_NORMAL), the start time of a radio timeslot is specified by
 *       p_request->distance_us and is given relative to the start of the previous timeslot.
 * @note A too small p_request->distance_us will lead to a @ref NRF_EVT_RADIO_BLOCKED event.
 * @note Timeslots scheduled too close will lead to a @ref NRF_EVT_RADIO_BLOCKED event.
 * @note See the SoftDevice Specification for more on radio timeslot scheduling, distances and lengths.
 * @note If an opportunity for the first radio timeslot is not found before 100 ms after the call to this
 *       function, it is not scheduled, and instead a @ref NRF_EVT_RADIO_BLOCKED event is sent.
 *       The application may then try to schedule the first radio timeslot again.
 * @note Successful requests will result in nrf_radio_signal_callback_t(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_START).
 *       Unsuccessful requests will result in a @ref NRF_EVT_RADIO_BLOCKED event, see @ref NRF_SOC_EVTS.
 * @note The jitter in the start time of the radio timeslots is +/- @ref NRF_RADIO_START_JITTER_US us.
 * @note The nrf_radio_signal_callback_t(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_START) call has a latency relative to the
 *       specified radio timeslot start, but this does not affect the actual start time of the timeslot.
 * @note NRF_TIMER0 is reset at the start of the radio timeslot, and is clocked at 1MHz from the high frequency
 *       (16 MHz) clock source. If p_request->hfclk_force_xtal is true, the high frequency clock is
 *       guaranteed to be clocked from the external crystal.
 * @note The SoftDevice will neither access the NRF_RADIO peripheral nor the NRF_TIMER0 peripheral
 *       during the radio timeslot.
 *
 * @param[in] p_request Pointer to the request parameters.
 *
 * @retval ::NRF_ERROR_FORBIDDEN Either:
 *                                - The session is not open.
 *                                - The session is not IDLE.
 *                                - This is the first request and its type is not @ref NRF_RADIO_REQ_TYPE_EARLIEST.
 *                                - The request type was set to @ref NRF_RADIO_REQ_TYPE_NORMAL after a
 *                                  @ref NRF_RADIO_REQ_TYPE_EARLIEST request was blocked.
 * @retval ::NRF_ERROR_INVALID_ADDR If the p_request pointer is invalid.
 * @retval ::NRF_ERROR_INVALID_PARAM If the parameters of p_request are not valid.
 * @retval ::NRF_SUCCESS Otherwise.
 */
 SVCALL(SD_RADIO_REQUEST, uint32_t, sd_radio_request(nrf_radio_request_t const * p_request));

/**@brief Write register protected by the SoftDevice
 *
 * This function writes to a register that is write-protected by the SoftDevice. Please refer to your
 * SoftDevice Specification for more details about which registers that are protected by SoftDevice.
 * This function can write to the following protected peripheral:
 *  - ACL
 *
 * @note Protected registers may be read directly.
 * @note Register that are write-once will return @ref NRF_SUCCESS on second set, even the value in
 *       the register has not changed. See the Product Specification for more details about register
 *       properties.
 *
 * @param[in]  p_register Pointer to register to be written.
 * @param[in]  value Value to be written to the register.
 *
 * @retval ::NRF_ERROR_INVALID_ADDR This function can not write to the reguested register.
 * @retval ::NRF_SUCCESS Value successfully written to register.
 *
 */
SVCALL(SD_PROTECTED_REGISTER_WRITE, uint32_t, sd_protected_register_write(volatile uint32_t * p_register, uint32_t value));

/**@} */

#ifdef __cplusplus
}
#endif
#endif // NRF_SOC_H__

/**@} */

#ifdef __clang__

#ifndef _CLANG_NRF_SOC_H_
#define _CLANG_NRF_SOC_H_

#ifdef __cplusplus
extern "C" {
#endif

// prevent from upgrading nRF52 header files more than once
#define NRF_CLANG_SUPPORT 1

// define system call macros only once
#ifndef _SYSCALL_ARGS

#define _SYSCALL_ARGS(_SC_, ...) \
   __asm__ __volatile__ ( \
      "svc %[SC]" \
         : "=r"(r0) : [SC]"I" ((uint16_t)_SC_), ##__VA_ARGS__ : "memory"); \
   return r0; \

#define _SCC(X) ((long) (X))

#define _SYSCALL0(_SC_) \
   register long r0 __asm__("r0"); \
   _SYSCALL_ARGS(_SC_); \

#define _SYSCALL1(_SC_, _a_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   _SYSCALL_ARGS(_SC_, "0"(r0)); \

#define _SYSCALL2(_SC_, _a_, _b_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   register long r1 __asm__("r1") = _SCC(_b_); \
   _SYSCALL_ARGS(_SC_, "0"(r0), "r"(r1)); \

#define _SYSCALL3(_SC_, _a_, _b_, _c_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   register long r1 __asm__("r1") = _SCC(_b_); \
   register long r2 __asm__("r2") = _SCC(_c_); \
   _SYSCALL_ARGS(_SC_, "0"(r0), "r"(r1), "r"(r2)); \

#define _SYSCALL4(_SC_, _a_, _b_, _c_, _d_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   register long r1 __asm__("r1") = _SCC(_b_); \
   register long r2 __asm__("r2") = _SCC(_c_); \
   register long r3 __asm__("r3") = _SCC(_d_); \
   _SYSCALL_ARGS(_SC_, "0"(r0), "r"(r1), "r"(r2), "r"(r3)); \

#endif // SYSCALL_CP

static inline uint32_t
sd_mutex_new(nrf_mutex_t * p_mutex) {
   _SYSCALL1(SD_MUTEX_NEW, p_mutex);
}

static inline uint32_t
sd_mutex_acquire(nrf_mutex_t * p_mutex) {
   _SYSCALL1(SD_MUTEX_ACQUIRE, p_mutex);
}

static inline uint32_t
sd_mutex_release(nrf_mutex_t * p_mutex) {
   _SYSCALL1(SD_MUTEX_RELEASE, p_mutex);
}

static inline uint32_t
sd_rand_application_pool_capacity_get(uint8_t * p_pool_capacity) {
   _SYSCALL1(SD_RAND_APPLICATION_POOL_CAPACITY_GET, p_pool_capacity);
}

static inline uint32_t
sd_rand_application_bytes_available_get(uint8_t * p_bytes_available) {
   _SYSCALL1(SD_RAND_APPLICATION_BYTES_AVAILABLE_GET, p_bytes_available);
}

static inline uint32_t
sd_rand_application_vector_get(uint8_t * p_buff, uint8_t length) {
   _SYSCALL2(SD_RAND_APPLICATION_VECTOR_GET, p_buff, length);
}

static inline uint32_t
sd_power_reset_reason_get(uint32_t * p_reset_reason) {
   _SYSCALL1(SD_POWER_RESET_REASON_GET, p_reset_reason);
}

static inline uint32_t
sd_power_reset_reason_clr(uint32_t reset_reason_clr_msk) {
   _SYSCALL1(SD_POWER_RESET_REASON_CLR, reset_reason_clr_msk);
}

static inline uint32_t
sd_power_mode_set(uint8_t power_mode) {
   _SYSCALL1(SD_POWER_MODE_SET, power_mode);
}

static inline uint32_t
sd_power_system_off(void) {
   _SYSCALL0(SD_POWER_SYSTEM_OFF);
}

static inline uint32_t
sd_power_pof_enable(uint8_t pof_enable) {
   _SYSCALL1(SD_POWER_POF_ENABLE, pof_enable);
}

static inline uint32_t
sd_power_usbpwrrdy_enable(uint8_t usbpwrrdy_enable) {
   _SYSCALL1(SD_POWER_USBPWRRDY_ENABLE, usbpwrrdy_enable);
}

static inline uint32_t
sd_power_usbdetected_enable(uint8_t usbdetected_enable) {
   _SYSCALL1(SD_POWER_USBDETECTED_ENABLE, usbdetected_enable);
}

static inline uint32_t
sd_power_usbremoved_enable(uint8_t usbremoved_enable) {
   _SYSCALL1(SD_POWER_USBREMOVED_ENABLE, usbremoved_enable);
}

static inline uint32_t
sd_power_usbregstatus_get(uint32_t * usbregstatus) {
   _SYSCALL1(SD_POWER_USBREGSTATUS_GET, usbregstatus);
}

static inline uint32_t
sd_power_pof_threshold_set(uint8_t threshold) {
   _SYSCALL1(SD_POWER_POF_THRESHOLD_SET, threshold);
}

static inline uint32_t
sd_power_pof_thresholdvddh_set(uint8_t threshold) {
   _SYSCALL1(SD_POWER_POF_THRESHOLDVDDH_SET, threshold);
}

static inline uint32_t
sd_power_ram_power_set(uint8_t index, uint32_t ram_powerset) {
   _SYSCALL2(SD_POWER_RAM_POWER_SET, index, ram_powerset);
}

static inline uint32_t
sd_power_ram_power_clr(uint8_t index, uint32_t ram_powerclr) {
   _SYSCALL2(SD_POWER_RAM_POWER_CLR, index, ram_powerclr);
}

static inline uint32_t
sd_power_ram_power_get(uint8_t index, uint32_t * p_ram_power) {
   _SYSCALL2(SD_POWER_RAM_POWER_GET, index, p_ram_power);
}

static inline uint32_t
sd_power_gpregret_set(uint32_t gpregret_id, uint32_t gpregret_msk) {
   _SYSCALL2(SD_POWER_GPREGRET_SET, gpregret_id, gpregret_msk);
}

static inline uint32_t
sd_power_gpregret_clr(uint32_t gpregret_id, uint32_t gpregret_msk) {
   _SYSCALL2(SD_POWER_GPREGRET_CLR, gpregret_id, gpregret_msk);
}

static inline uint32_t
sd_power_gpregret_get(uint32_t gpregret_id, uint32_t *p_gpregret) {
   _SYSCALL2(SD_POWER_GPREGRET_GET, gpregret_id, p_gpregret);
}

static inline uint32_t
sd_power_dcdc_mode_set(uint8_t dcdc_mode) {
   _SYSCALL1(SD_POWER_DCDC_MODE_SET, dcdc_mode);
}

static inline uint32_t
sd_clock_hfclk_request(void) {
   _SYSCALL0(SD_CLOCK_HFCLK_REQUEST);
}

static inline uint32_t
sd_clock_hfclk_release(void) {
   _SYSCALL0(SD_CLOCK_HFCLK_RELEASE);
}

static inline uint32_t
sd_clock_hfclk_is_running(uint32_t * p_is_running) {
   _SYSCALL1(SD_CLOCK_HFCLK_IS_RUNNING, p_is_running);
}

static inline uint32_t
sd_app_evt_wait(void) {
   _SYSCALL0(SD_APP_EVT_WAIT);
}

static inline uint32_t
sd_ppi_channel_enable_get(uint32_t * p_channel_enable) {
   _SYSCALL1(SD_PPI_CHANNEL_ENABLE_GET, p_channel_enable);
}

static inline uint32_t
sd_ppi_channel_enable_set(uint32_t channel_enable_set_msk) {
   _SYSCALL1(SD_PPI_CHANNEL_ENABLE_SET, channel_enable_set_msk);
}

static inline uint32_t
sd_ppi_channel_enable_clr(uint32_t channel_enable_clr_msk) {
   _SYSCALL1(SD_PPI_CHANNEL_ENABLE_CLR, channel_enable_clr_msk);
}

static inline uint32_t
sd_ppi_channel_assign(uint8_t channel_num, const volatile void * evt_endpoint, const volatile void * task_endpoint) {
   _SYSCALL3(SD_PPI_CHANNEL_ASSIGN, channel_num, evt_endpoint, task_endpoint);
}

static inline uint32_t
sd_ppi_group_task_enable(uint8_t group_num) {
   _SYSCALL1(SD_PPI_GROUP_TASK_ENABLE, group_num);
}

static inline uint32_t
sd_ppi_group_task_disable(uint8_t group_num) {
   _SYSCALL1(SD_PPI_GROUP_TASK_DISABLE, group_num);
}

static inline uint32_t
sd_ppi_group_assign(uint8_t group_num, uint32_t channel_msk) {
   _SYSCALL2(SD_PPI_GROUP_ASSIGN, group_num, channel_msk);
}

static inline uint32_t
sd_ppi_group_get(uint8_t group_num, uint32_t * p_channel_msk) {
   _SYSCALL2(SD_PPI_GROUP_GET, group_num, p_channel_msk);
}

static inline uint32_t
sd_radio_notification_cfg_set(uint8_t type, uint8_t distance) {
   _SYSCALL2(SD_RADIO_NOTIFICATION_CFG_SET, type, distance);
}

static inline uint32_t
sd_ecb_block_encrypt(nrf_ecb_hal_data_t * p_ecb_data) {
   _SYSCALL1(SD_ECB_BLOCK_ENCRYPT, p_ecb_data);
}

static inline uint32_t
sd_ecb_blocks_encrypt(uint8_t block_count, nrf_ecb_hal_data_block_t * p_data_blocks) {
   _SYSCALL2(SD_ECB_BLOCKS_ENCRYPT, block_count, p_data_blocks);
}

static inline uint32_t
sd_evt_get(uint32_t * p_evt_id) {
   _SYSCALL1(SD_EVT_GET, p_evt_id);
}

static inline uint32_t
sd_temp_get(int32_t * p_temp) {
   _SYSCALL1(SD_TEMP_GET, p_temp);
}

static inline uint32_t
sd_flash_write(uint32_t * p_dst, uint32_t const * p_src, uint32_t size) {
   _SYSCALL3(SD_FLASH_WRITE, p_dst, p_src, size);
}

static inline uint32_t
sd_flash_page_erase(uint32_t page_number) {
   _SYSCALL1(SD_FLASH_PAGE_ERASE, page_number);
}

static inline uint32_t
sd_radio_session_open(nrf_radio_signal_callback_t p_radio_signal_callback) {
   _SYSCALL1(SD_RADIO_SESSION_OPEN, p_radio_signal_callback);
}

static inline uint32_t
sd_radio_session_close(void) {
   _SYSCALL0(SD_RADIO_SESSION_CLOSE);
}

static inline uint32_t
sd_radio_request(nrf_radio_request_t const * p_request) {
   _SYSCALL1(SD_RADIO_REQUEST, p_request);
}

static inline uint32_t
sd_protected_register_write(volatile uint32_t * p_register, uint32_t value) {
   _SYSCALL2(SD_PROTECTED_REGISTER_WRITE, p_register, value);
}


#ifdef __cplusplus
}
#endif

#endif // _CLANG_NRF_SOC_H_

#endif // __clang__

